"[{\"character\":\"Myriel\",\"degree_centrality\":10,\"info\":\" The Bishop of Digne (full name Charles-Fran\\u00e7ois-Bienvenu Myriel, also called Monseigneur Bienvenu) A kindly old priest promoted to bishop after a chance encounter with Napoleon. After Valjean steals some silver from him, he saves Valjean from being arrested and inspires Valjean to change his ways.\",\"community\":0,\"eigenvector_centrality\":0.028134336,\"betweenness_centrality\":0.1768421053,\"closeness_centrality\":0.4293785311},{\"character\":\"Napoleon\",\"degree_centrality\":1,\"info\":\" A French statesman and military leader who became notorious as an artillery commander during the French Revolution. He became the emperor of France.\",\"community\":0,\"eigenvector_centrality\":0.002343456,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3015873016},{\"character\":\"MlleBaptistine\",\"degree_centrality\":3,\"info\":\" Bishop Myriel's sister. She loves and venerates her brother.\",\"community\":1,\"eigenvector_centrality\":0.0268729998,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.4130434783},{\"character\":\"MmeMagloire\",\"degree_centrality\":3,\"info\":\" Domestic servant to Bishop Myriel and his sister.\",\"community\":1,\"eigenvector_centrality\":0.0268729998,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.4130434783},{\"character\":\"CountessDeLo\",\"degree_centrality\":1,\"info\":\" \",\"community\":0,\"eigenvector_centrality\":0.002343456,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3015873016},{\"character\":\"Geborand\",\"degree_centrality\":1,\"info\":\" A wealthy retired merchant  who was somewhat of a usurer  who had amassed two millions in the manufacture of coarse cloth  serges  and woollen galloons. Never in his whole life had M. Geborand bestowed alms on any poor wretch.\",\"community\":0,\"eigenvector_centrality\":0.002343456,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3015873016},{\"character\":\"Champtercier\",\"degree_centrality\":1,\"info\":\" A wealthy and avaricious old man  who contrived to be  at one and the same time  an ultra-royalist and an ultra-Voltairian. This variety of man has actually existed. When the Bishop came to him  he touched his arm  \\u201cYou must give me something  M. le Marquis.\\u201d The Marquis turned round and answered dryly  \\u201cI have poor people of my own  Monseigneur.\\u201d \\u201cGive them to me \\u201d replied the Bishop.\",\"community\":0,\"eigenvector_centrality\":0.002343456,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3015873016},{\"character\":\"Cravatte\",\"degree_centrality\":1,\"info\":\" After the destruction of the band of Gaspard B\\u00e8s  who had infested the gorges of Ollioules  one of his lieutenants  Cravatte  took refuge in the mountains.\",\"community\":0,\"eigenvector_centrality\":0.002343456,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3015873016},{\"character\":\"Count\",\"degree_centrality\":1,\"info\":\" \",\"community\":0,\"eigenvector_centrality\":0.002343456,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3015873016},{\"character\":\"OldMan\",\"degree_centrality\":1,\"info\":\" An old revolutionary visited by Bishop Myriel on his deathbed. They discuss the politics and morality of revolution  and Myriel comes to marvel at his \\\"spiritual radicalism\\\"  asking his blessing as he dies.\",\"community\":0,\"eigenvector_centrality\":0.002343456,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3015873016},{\"character\":\"Labarre\",\"degree_centrality\":1,\"info\":\" An innkepeer of La Croix de Calbas\",\"community\":1,\"eigenvector_centrality\":0.0222911529,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3937823834},{\"character\":\"Valjean\",\"degree_centrality\":36,\"info\":\" (also known as Monsieur Madeleine, Ultime Fauchelevent, Monsieur Leblanc, and Urbain Fabre) The protagonist of the novel. Convicted for stealing a loaf of bread to feed his sister's seven starving children and sent to prison for five years, he is paroled from prison nineteen years later (after four unsuccessful escape attempts added twelve years and fighting back during the second escape attempt added two extra years). Rejected by society for being a former convict, he encounters Bishop Myriel, who turns his life around by showing him mercy and encouraging him to become a new man. While sitting and pondering what Bishop Myriel had said, he puts his shoe on a forty-sou piece dropped by a young wanderer. Valjean threatens the boy with his stick when the boy attempts to rouse Valjean from his reverie and recover his money. He tells a passing priest his name, and the name of the boy, and this allows the police to charge him with armed robbery a sentence that, if he were caught again, would return him to prison for life. He assumes a new identity (Monsieur Madeleine) in order to pursue an honest life. He introduces new manufacturing techniques and eventually builds two factories and becomes one of the richest men in the area. By popular acclaim, he is made mayor. He confronts Javert over Fantine's punishment, turns himself in to the police to save another man from prison for life, and rescues Cosette from the Th\\u00e9nardiers. Discovered by Javert in Paris because of his generosity to the poor, he evades capture for the next several years in a convent. He saves Marius from imprisonment and probable death at the barricade, reveals his true identity to Marius and Cosette after their wedding, and is reunited with them just before his death, having kept his promise to the bishop and to Fantine, the image of whom is the last thing he sees before dying.\",\"community\":1,\"eigenvector_centrality\":0.267618176,\"betweenness_centrality\":0.5699890528,\"closeness_centrality\":0.6440677966},{\"character\":\"Marguerite\",\"degree_centrality\":2,\"info\":\" The prioress of the Petit-Picpus convent.\",\"community\":1,\"eigenvector_centrality\":0.0297677147,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.4130434783},{\"character\":\"MmeDeR\",\"degree_centrality\":1,\"info\":\"\",\"community\":1,\"eigenvector_centrality\":0.0222911529,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3937823834},{\"character\":\"Isabeau\",\"degree_centrality\":1,\"info\":\" A baker whom Valjean stolen a bread from. \",\"community\":1,\"eigenvector_centrality\":0.0222911529,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3937823834},{\"character\":\"Gervais\",\"degree_centrality\":1,\"info\":\" A travelling Savoyard boy who drops a coin. Valjean, still a man of criminal mind, places his foot on the coin and refuses to return it.\",\"community\":1,\"eigenvector_centrality\":0.0222911529,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3937823834},{\"character\":\"Tholomyes\",\"degree_centrality\":9,\"info\":\" Fantine's lover and Cosette's biological father. A wealthy, self-centered student in Paris originally from Toulouse, he eventually abandons Fantine when their daughter is two years old.\",\"community\":2,\"eigenvector_centrality\":0.0481461559,\"betweenness_centrality\":0.0406293482,\"closeness_centrality\":0.3917525773},{\"character\":\"Listolier\",\"degree_centrality\":7,\"info\":\" A wealthy student in Paris originally from Cahors. He is a friend of F\\u00e9lix Tholomy\\u00e8s and becomes romantically involved with Fantine's friend Dahlia.\",\"community\":2,\"eigenvector_centrality\":0.0196857367,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3408071749},{\"character\":\"Fameuil\",\"degree_centrality\":7,\"info\":\" A wealthy student in Paris originally from Limoges. He is a friend of F\\u00e9lix Tholomy\\u00e8s and becomes romantically involved with Fantine's friend Z\\u00e9phine.\",\"community\":2,\"eigenvector_centrality\":0.0196857367,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3408071749},{\"character\":\"Blacheville\",\"degree_centrality\":7,\"info\":\" A wealthy student in Paris originally from Montauban. He is a friend of F\\u00e9lix Tholomy\\u00e8s and becomes romantically involved with Fantine's friend Favourite.\",\"community\":2,\"eigenvector_centrality\":0.0196857367,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3408071749},{\"character\":\"Favourite\",\"degree_centrality\":7,\"info\":\" A young grisette in Paris and leader of Fantine's group of seamstress friends (including Z\\u00e9phine and Dahlia). She is independent and well versed in the ways of the world and had previously been in England. Although she cannot stand F\\u00e9lix Tholomy\\u00e8s' friend Blachevelle and is in love with someone else, she endures a relationship with him so she can enjoy the perks of courting a wealthy man.\",\"community\":2,\"eigenvector_centrality\":0.0196857367,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3408071749},{\"character\":\"Dahlia\",\"degree_centrality\":7,\"info\":\" A young grisette in Paris and member of Fantine's group of seamstress friends along with Favourite and Z\\u00e9phine. She becomes romantically involved with F\\u00e9lix Tholomy\\u00e8s' friend Listolier.\",\"community\":2,\"eigenvector_centrality\":0.0196857367,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3408071749},{\"character\":\"Zephine\",\"degree_centrality\":7,\"info\":\" A young grisette in Paris and member of Fantine's group of seamstress friends along with Favourite and Dahlia. She becomes romantically involved with F\\u00e9lix Tholomy\\u00e8s' friend Fameuil.\",\"community\":2,\"eigenvector_centrality\":0.0196857367,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3408071749},{\"character\":\"Fantine\",\"degree_centrality\":15,\"info\":\" A beautiful Parisian grisette abandoned with a small child by her lover F\\u00e9lix Tholomy\\u00e8s. Fantine leaves her daughter Cosette in the care of the Th\\u00e9nardiers, innkeepers in the village of Montfermeil. Mme. Th\\u00e9nardier spoils her own daughters and abuses Cosette. Fantine finds work at Monsieur Madeleine's factory. Illiterate, she has others write letters to the Th\\u00e9nardiers on her behalf. A female supervisor discovers that she is an unwed mother and dismisses her. To meet the Th\\u00e9nardiers' repeated demands for money, she sells her hair and two front teeth, and turns to prostitution. She becomes ill. Valjean learns of her plight when Javert arrests her for attacking a man who called her insulting names and threw snow down her back, and sends her to a hospital. As Javert confronts Valjean in her hospital room, because her illness has made her so weak, she dies of shock after Javert reveals that Valjean is a convict and hasn't brought her daughter Cosette to her (after the doctor encouraged that incorrect belief that Jean Valjean's recent absence was because he was bringing her daughter to her).\",\"community\":2,\"eigenvector_centrality\":0.0897592295,\"betweenness_centrality\":0.129644541,\"closeness_centrality\":0.4606060606},{\"character\":\"MmeThenardier\",\"degree_centrality\":11,\"info\":\" The wife of M Thenardier.\",\"community\":3,\"eigenvector_centrality\":0.1222824217,\"betweenness_centrality\":0.0290024187,\"closeness_centrality\":0.4606060606},{\"character\":\"Thenardier\",\"degree_centrality\":16,\"info\":\" (also known as the Jondrettes, M. Fabantou, M. Th\\u00e9nard. Some translations identify her as <i>the Thenardiess<\\/i>) Husband and wife, parents of five children: two daughters, \\u00c9ponine and Azelma, and three sons, Gavroche and two unnamed younger sons. As innkeepers, they abuse Cosette as a child and extort payment from Fantine for her support, until Valjean takes Cosette away. They become bankrupt and relocate under the name Jondrette to a house in Paris called the Gorbeau house, living in the room next to Marius. The husband associates with a criminal group called \\\"the Patron-Minette\\\", and conspires to rob Valjean until he is thwarted by Marius. Javert arrests the couple. The wife dies in prison. Her husband attempts to blackmail Marius with his knowledge of Valjean's past, but Marius pays him to leave the country and he becomes a slave trader in the United States.\",\"community\":1,\"eigenvector_centrality\":0.1878077052,\"betweenness_centrality\":0.0749012212,\"closeness_centrality\":0.5170068027},{\"character\":\"Cosette\",\"degree_centrality\":11,\"info\":\" (formally Euphrasie, also known as \\\"the Lark\\\", Mademoiselle Lanoire, Ursula) The illegitimate daughter of Fantine and Tholomy\\u00e8s. From approximately the age of three to the age of eight, she is beaten and forced to work as a drudge for the Th\\u00e9nardiers. After her mother Fantine dies, Valjean ransoms Cosette from the Th\\u00e9nardiers and cares for her as if she were his daughter. Nuns in a Paris convent educate her. She grows up to become very beautiful. She falls in love with Marius Pontmercy and marries him near the novel's conclusion.\",\"community\":1,\"eigenvector_centrality\":0.111037024,\"betweenness_centrality\":0.0237962535,\"closeness_centrality\":0.4779874214},{\"character\":\"Javert\",\"degree_centrality\":17,\"info\":\" A fanatic police inspector in pursuit to recapture Valjean. Born in the prisons to a convict father and a fortune teller mother, he renounces both of them and starts working as a guard in the prison, including one stint as the overseer for the chain gang of which Valjean is part (and here witnesses firsthand Valjean's enormous strength and just what he looks like). Eventually he joins the police force in the small town identified only as M____-sur-M__. He arrests Fantine and butts heads with Valjean\\/Madeleine, who orders him to release Fantine. Valjean dismisses Javert in front of his squad and Javert, seeking revenge, reports to the Police Inspector that he has discovered Jean Valjean. He is told that he must be incorrect, as a man mistakenly believed to be Jean Valjean was just arrested. He requests of M. Madeline that he be dismissed in disgrace, for he cannot be less harsh on himself than on others. When the real Jean Valjean turns himself in, Javert is promoted to the Paris police force where he arrests Valjean and sends him back to prison. After Valjean escapes again, Javert attempts one more arrest in vain. He then almost recaptures Valjean at Gorbeau house when he arrests the Th\\u00e9nardiers and Patron-Minette. Later, while working undercover behind the barricade, his identity is discovered. Valjean pretends to execute Javert, but releases him. When Javert next encounters Valjean emerging from the sewers, he allows him to make a brief visit home and then walks off instead of arresting him. Javert cannot reconcile his devotion to the law with his recognition that the lawful course is immoral. After composing a letter to the prefect of police outlining the squalid conditions that occur in prisons and the abuses that prisoners are subjected to, he takes his own life by jumping into the Seine.\",\"community\":1,\"eigenvector_centrality\":0.1842251632,\"betweenness_centrality\":0.0543315597,\"closeness_centrality\":0.5170068027},{\"character\":\"Fauchelevent\",\"degree_centrality\":4,\"info\":\" A failed businessman whom Valjean (as M. Madeleine) saves from being crushed under a carriage. Valjean gets him a position as gardener at a Paris convent, where Fauchelevent later provides sanctuary for Valjean and Cosette and allows Valjean to pose as his brother.\",\"community\":4,\"eigenvector_centrality\":0.0400486067,\"betweenness_centrality\":0.0264912281,\"closeness_centrality\":0.4021164021},{\"character\":\"Bamatabois\",\"degree_centrality\":8,\"info\":\" An idler who harasses Fantine. Later a juror at Champmathieu's trial.\",\"community\":5,\"eigenvector_centrality\":0.0622750619,\"betweenness_centrality\":0.0080409357,\"closeness_centrality\":0.4269662921},{\"character\":\"Perpetue\",\"degree_centrality\":2,\"info\":\" A nun  an ordinary villager  a sister of charity in a coarse style  who had entered the service of God as\",\"community\":6,\"eigenvector_centrality\":0.0113127316,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3179916318},{\"character\":\"Simplice\",\"degree_centrality\":4,\"info\":\" A famously truthful nun who cares for Fantine on her sickbed and lies to Javert to protect Valjean.\",\"community\":6,\"eigenvector_centrality\":0.046055011,\"betweenness_centrality\":0.008640295,\"closeness_centrality\":0.4175824176},{\"character\":\"Scaufflaire\",\"degree_centrality\":1,\"info\":\" A Fleming named Master Scaufflaer  French Scaufflaire  who let out \\u2018horses and cabriolets as desired.\\u2019\",\"community\":1,\"eigenvector_centrality\":0.0222911529,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3937823834},{\"character\":\"Woman1\",\"degree_centrality\":2,\"info\":\" \",\"community\":1,\"eigenvector_centrality\":0.0376361395,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3958333333},{\"character\":\"Judge\",\"degree_centrality\":6,\"info\":\"\",\"community\":5,\"eigenvector_centrality\":0.041208283,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.4042553191},{\"character\":\"Champmathieu\",\"degree_centrality\":6,\"info\":\" A vagabond who is misidentified as Valjean after being caught stealing apples.\",\"community\":5,\"eigenvector_centrality\":0.041208283,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.4042553191},{\"character\":\"Brevet\",\"degree_centrality\":6,\"info\":\" An ex-convict from Toulon who knew Valjean there; released one year after Valjean. In 1823, he is serving time in the prison in Arras for an unknown crime. He is the first to claim that Champmathieu is really Valjean. He used to wear knitted, checkered suspenders.\",\"community\":5,\"eigenvector_centrality\":0.041208283,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.4042553191},{\"character\":\"Chenildieu\",\"degree_centrality\":6,\"info\":\" A lifer from Toulon. He and Valjean were chain mates for five years. He once tried to unsuccessfully remove his lifer's brand TFP (\\\"travaux forc\\u00e9s \\u00e0 perpetuit\\u00e9\\\", \\\"forced labour for life\\\") by putting his shoulder on a chafing dish full of embers. He is described as a small, wiry but energetic man.\",\"community\":5,\"eigenvector_centrality\":0.041208283,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.4042553191},{\"character\":\"Cochepaille\",\"degree_centrality\":6,\"info\":\" Another lifer from Toulon. He used to be a shepherd from the Pyrenees who became a smuggler. He is described as stupid and has a tattoo on his arm, <i>1 Mars 1815<\\/i>.\",\"community\":5,\"eigenvector_centrality\":0.041208283,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.4042553191},{\"character\":\"Pontmercy\",\"degree_centrality\":3,\"info\":\" A young law student loosely associated with the Friends of the ABC. He shares the political principles of his father and has a tempestuous relationship with his royalist grandfather, Monsieur Gillenormand. He falls in love with Cosette and fights on the barricades when he believes Valjean has taken her to London. After he and Cosette marry, he recognizes Th\\u00e9nardier as a swindler and pays him to leave France.\",\"community\":1,\"eigenvector_centrality\":0.0379269667,\"betweenness_centrality\":0.0069254386,\"closeness_centrality\":0.3725490196},{\"character\":\"Boulatruelle\",\"degree_centrality\":1,\"info\":\" A local ne\\u2019r-do-well in Montfermeil  spends years trying to find Valjean\\u2019s secret cache of buried bank notes  taking breaks in between to help Th\\u00e9nardier out in his Parisian life of crime.\",\"community\":1,\"eigenvector_centrality\":0.0156433774,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3423423423},{\"character\":\"Eponine\",\"degree_centrality\":11,\"info\":\" (the Jondrette girl) The Th\\u00e9nardiers' elder daughter. As a child, she is pampered and spoiled by her parents, but ends up a street urchin when she reaches adolescence. She participates in her father's crimes and begging schemes to obtain money. She is blindly in love with Marius. At Marius' request, she finds Valjean and Cosette's house for him and sadly leads him there. She also prevents her father, Patron-Minette, and Brujon from robbing the house during one of Marius' visits there to see Cosette. After disguising herself as a boy, she manipulates Marius into going to the barricades, hoping that she and Marius will die there together. Wanting to die before Marius, she reaches out her hand to stop a soldier from shooting at him; she is mortally wounded as the bullet goes through her hand and her back. As she is dying, she confesses all this to Marius, and gives him a letter from Cosette. Her final request to Marius is that once she has passed, he will kiss her on the forehead. He fulfills her request not because of romantic feelings on his part, but out of pity for her hard life.\",\"community\":1,\"eigenvector_centrality\":0.1419382736,\"betweenness_centrality\":0.0114875507,\"closeness_centrality\":0.3958333333},{\"character\":\"Anzelma\",\"degree_centrality\":3,\"info\":\" The younger daughter of the Th\\u00e9nardiers. Like her sister \\u00c9ponine, she is spoiled as a child, impoverished when older. She abets her father's failed robbery of Valjean. On Marius and Cosette's wedding day, she tails Valjean on her father's orders. She travels to America with her father at the end of the novel.\",\"community\":1,\"eigenvector_centrality\":0.0376515419,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3518518519},{\"character\":\"Woman2\",\"degree_centrality\":3,\"info\":\"\",\"community\":1,\"eigenvector_centrality\":0.0468849424,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.4021164021},{\"character\":\"MotherInnocent\",\"degree_centrality\":2,\"info\":\" (a.k.a. Marguerite de Blemeur) The prioress of the Petit-Picpus convent.\",\"community\":4,\"eigenvector_centrality\":0.0256270073,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3979057592},{\"character\":\"Gribier\",\"degree_centrality\":1,\"info\":\" A new gravedigger who replaces Mestienne  friend of Fauchelevent who just died. He nearly causing Valjean to be buried alive.\",\"community\":4,\"eigenvector_centrality\":0.0033358544,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.2878787879},{\"character\":\"Jondrette\",\"degree_centrality\":1,\"info\":\" An inn-keeper at Montfermeil who takes Cosette in and then attempts to swindle Fantine by demanding larger and larger sums of money for Cosette\\u2019s care.\",\"community\":7,\"eigenvector_centrality\":0.0022204916,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.2567567568},{\"character\":\"MmeBurgon\",\"degree_centrality\":2,\"info\":\" (called Ma'am Burgon) Housekeeper of Gorbeau House.\",\"community\":7,\"eigenvector_centrality\":0.0266587677,\"betweenness_centrality\":0.0263157895,\"closeness_centrality\":0.3438914027},{\"character\":\"Gavroche\",\"degree_centrality\":22,\"info\":\" The unloved middle child and eldest son of the Th\\u00e9nardiers. He lives on his own as a street urchin and sleeps inside an elephant statue outside the Bastille. He briefly takes care of his two younger brothers, unaware they are related to him. He takes part in the barricades and is killed while collecting bullets from dead National Guardsmen.\",\"community\":8,\"eigenvector_centrality\":0.3178389398,\"betweenness_centrality\":0.1651125024,\"closeness_centrality\":0.5135135135},{\"character\":\"Gillenormand\",\"degree_centrality\":7,\"info\":\" Marius' grandfather. A monarchist, he disagrees sharply with Marius on political issues, and they have several arguments. He attempts to keep Marius from being influenced by his father, Colonel Georges Pontmercy. While in perpetual conflict over ideas, he does illustrate his love for his grandson.\",\"community\":1,\"eigenvector_centrality\":0.065397297,\"betweenness_centrality\":0.0202106216,\"closeness_centrality\":0.4418604651},{\"character\":\"Magnon\",\"degree_centrality\":2,\"info\":\" Former servant of M. Gillenormand and friend of the Th\\u00e9nardiers. She had been receiving child support payments from M. Gillenormand for her two illegitimate sons, who she claimed were fathered by him. When her sons died in an epidemic, she had them replaced with the Th\\u00e9nardiers' two youngest sons so that she could protect her income. The Th\\u00e9nardiers get a portion of the payments. She is incorrectly arrested for involvement in the Gorbeau robbery.\",\"community\":3,\"eigenvector_centrality\":0.0156327589,\"betweenness_centrality\":0.0002172097,\"closeness_centrality\":0.3348017621},{\"character\":\"MlleGillenormand\",\"degree_centrality\":7,\"info\":\" Daughter of M. Gillenormand, with whom she lives. Her late half-sister (M. Gillenormand's daughter from another marriage), was Marius' mother.\",\"community\":1,\"eigenvector_centrality\":0.0631690514,\"betweenness_centrality\":0.0475989279,\"closeness_centrality\":0.4418604651},{\"character\":\"MmePontmercy\",\"degree_centrality\":2,\"info\":\" Mother of Marius. She died in 1815 when he was five years old. \",\"community\":1,\"eigenvector_centrality\":0.0084207102,\"betweenness_centrality\":0.0003508772,\"closeness_centrality\":0.3153526971},{\"character\":\"MlleVaubois\",\"degree_centrality\":1,\"info\":\" An ancient virgin like herself  named Mademoiselle Vaubois  who was a positive blockhead  and beside whom Mademoiselle Gillenormand had the pleasure of being an eagle.\",\"community\":1,\"eigenvector_centrality\":0.0052616232,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3076923077},{\"character\":\"LtGillenormand\",\"degree_centrality\":4,\"info\":\"  M. Gillenormand's grandnephew. He is asked to spy on his cousin Marius.\",\"community\":1,\"eigenvector_centrality\":0.04153984,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3653846154},{\"character\":\"Marius\",\"degree_centrality\":19,\"info\":\" An idealistic student who falls passionately in love with Cosette and later marries her.\",\"community\":8,\"eigenvector_centrality\":0.2591111453,\"betweenness_centrality\":0.1320324886,\"closeness_centrality\":0.5314685315},{\"character\":\"BaronessT\",\"degree_centrality\":2,\"info\":\" Mme Th\\u00e9nardiers in disguise  with his husband appear at the wedding of Marius and Cosette  posing as the Baron and Baroness de Th\\u00e9nard. Marius sees through their disguise and orders them to leave  but they refuse to do so until they have properly extorted him.\",\"community\":1,\"eigenvector_centrality\":0.0270294139,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3518518519},{\"character\":\"Mabeuf\",\"degree_centrality\":11,\"info\":\" An elderly churchwarden, friend of Colonel Pontmercy, who after the Colonel's death befriends his son Marius and helps Marius realize his father loved him. Mabeuf loves plants and books, but sells his books and prints in order to pay for a friend's medical care. When Mabeuf finds a purse in his yard, he takes it to the police. After selling his last book, he joins the students in the insurrection. He is shot dead raising the flag atop the barricade.\",\"community\":1,\"eigenvector_centrality\":0.195028912,\"betweenness_centrality\":0.0276612364,\"closeness_centrality\":0.3958333333},{\"character\":\"Enjolras\",\"degree_centrality\":15,\"info\":\" The leader of <i>Les Amis de l'ABC<\\/i> (Friends of the ABC) in the Paris uprising. A resolute and charismatic youth, he is passionately committed to republican principles and the idea of progress. He and Grantaire are executed by the National Guards after the barricade falls.\",\"community\":8,\"eigenvector_centrality\":0.2671786328,\"betweenness_centrality\":0.0425533568,\"closeness_centrality\":0.4810126582},{\"character\":\"Combeferre\",\"degree_centrality\":11,\"info\":\" A medical student who is described as representing the philosophy of the revolution.\",\"community\":8,\"eigenvector_centrality\":0.2107345749,\"betweenness_centrality\":0.0012501456,\"closeness_centrality\":0.3917525773},{\"character\":\"Prouvaire\",\"degree_centrality\":9,\"info\":\" (also Jehan) A Romantic with knowledge of Italian, Latin, Greek, and Hebrew, and an interest in the Middle Ages.\",\"community\":8,\"eigenvector_centrality\":0.1758163545,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3568075117},{\"character\":\"Feuilly\",\"degree_centrality\":11,\"info\":\" An orphaned fan maker who taught himself to read and write. He is the only member of the Friends who is not a student.\",\"community\":8,\"eigenvector_centrality\":0.2107345749,\"betweenness_centrality\":0.0012501456,\"closeness_centrality\":0.3917525773},{\"character\":\"Courfeyrac\",\"degree_centrality\":13,\"info\":\"  A law student who is described as the centre of the group of Friends. He is honorable and warm and is Marius' closest companion.\",\"community\":8,\"eigenvector_centrality\":0.2324671972,\"betweenness_centrality\":0.0052670299,\"closeness_centrality\":0.4},{\"character\":\"Bahorel\",\"degree_centrality\":12,\"info\":\" A dandy and an idler from a peasant background, who is known well around the student caf\\u00e9s of Paris.\",\"community\":8,\"eigenvector_centrality\":0.2215536093,\"betweenness_centrality\":0.0021854883,\"closeness_centrality\":0.3937823834},{\"character\":\"Bossuet\",\"degree_centrality\":13,\"info\":\" (also L\\u00e8gle, Laigle, L'Aigle [<i>The Eagle<\\/i>] or Bossuet) The oldest member of the group. Considered notoriously unlucky, Lesgle begins balding at the age of twenty-five. It is Lesgle who introduces Marius to the Friends.\",\"community\":8,\"eigenvector_centrality\":0.2421307864,\"betweenness_centrality\":0.0307536502,\"closeness_centrality\":0.475},{\"character\":\"Joly\",\"degree_centrality\":12,\"info\":\" A medical student who has unusual theories about health. He is a hypochondriac and is described as the happiest of the Friends.\",\"community\":8,\"eigenvector_centrality\":0.2215536093,\"betweenness_centrality\":0.0021854883,\"closeness_centrality\":0.3937823834},{\"character\":\"Grantaire\",\"degree_centrality\":10,\"info\":\" Grantaire (Also known as \\\"R\\\") was a student revolutionary with little interest in the cause. He reveres Enjolras, and his admiration is the main reason that Grantaire spends time with <i>Les Amis de l'ABC<\\/i> (Friends of the ABC), despite Enjolras's occasional scorn for him. Grantaire is often drunk and is unconscious for the majority of the June Rebellion. Despite his pessimism, he eventually declares himself a believer in the Republic; he and Enjolras are executed by the National Guards after the barricade falls.\",\"community\":8,\"eigenvector_centrality\":0.1866353889,\"betweenness_centrality\":0.0001503759,\"closeness_centrality\":0.358490566},{\"character\":\"MotherPlutarch\",\"degree_centrality\":1,\"info\":\" Servant of M. Mabeuf; shares his poverty to the end.\",\"community\":1,\"eigenvector_centrality\":0.0162444655,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.2846441948},{\"character\":\"Gueulemer\",\"degree_centrality\":10,\"info\":\" A quartet of bandits who assist in the Th\\u00e9nardiers' ambush of Valjean at Gorbeau House and the attempted robbery at the Rue Plumet. The gang consists of Montparnasse, Claquesous, Babet, and Gueulemer. Claquesous, who escaped from the carriage transporting him to prison after the Gorbeau Robbery, joins the revolution under the guise of \\\"Le Cabuc\\\" and is executed by Enjolras for firing on civilians.\",\"community\":3,\"eigenvector_centrality\":0.1454315541,\"betweenness_centrality\":0.004960384,\"closeness_centrality\":0.4634146341},{\"character\":\"Babet\",\"degree_centrality\":10,\"info\":\" A quartet of bandits who assist in the Th\\u00e9nardiers' ambush of Valjean at Gorbeau House and the attempted robbery at the Rue Plumet. The gang consists of Montparnasse, Claquesous, Babet, and Gueulemer. Claquesous, who escaped from the carriage transporting him to prison after the Gorbeau Robbery, joins the revolution under the guise of \\\"Le Cabuc\\\" and is executed by Enjolras for firing on civilians.\",\"community\":1,\"eigenvector_centrality\":0.1454315541,\"betweenness_centrality\":0.004960384,\"closeness_centrality\":0.4634146341},{\"character\":\"Claquesous\",\"degree_centrality\":10,\"info\":\" A quartet of bandits who assist in the Th\\u00e9nardiers' ambush of Valjean at Gorbeau House and the attempted robbery at the Rue Plumet. The gang consists of Montparnasse, Claquesous, Babet, and Gueulemer. Claquesous, who escaped from the carriage transporting him to prison after the Gorbeau Robbery, joins the revolution under the guise of \\\"Le Cabuc\\\" and is executed by Enjolras for firing on civilians.\",\"community\":3,\"eigenvector_centrality\":0.1415362731,\"betweenness_centrality\":0.0048618042,\"closeness_centrality\":0.4523809524},{\"character\":\"Montparnasse\",\"degree_centrality\":9,\"info\":\" A quartet of bandits who assist in the Th\\u00e9nardiers' ambush of Valjean at Gorbeau House and the attempted robbery at the Rue Plumet. The gang consists of Montparnasse, Claquesous, Babet, and Gueulemer. Claquesous, who escaped from the carriage transporting him to prison after the Gorbeau Robbery, joins the revolution under the guise of \\\"Le Cabuc\\\" and is executed by Enjolras for firing on civilians.\",\"community\":1,\"eigenvector_centrality\":0.1360291945,\"betweenness_centrality\":0.0038738299,\"closeness_centrality\":0.4578313253},{\"character\":\"Toussaint\",\"degree_centrality\":3,\"info\":\" Valjean and Cosette's servant in Paris. She has a slight stutter.\",\"community\":1,\"eigenvector_centrality\":0.0468849424,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.4021164021},{\"character\":\"Child1\",\"degree_centrality\":2,\"info\":\" The two unnamed youngest sons of the Th\\u00e9nardiers, whom they send to Magnon to replace her two dead sons. Living on the streets, they encounter Gavroche, who is unaware they are his siblings but treats them like they are his brothers. After Gavroche's death, they retrieve bread tossed by a bourgeois man to geese in a fountain at the Luxembourg Garden.\",\"community\":9,\"eigenvector_centrality\":0.0288792593,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3423423423},{\"character\":\"Child2\",\"degree_centrality\":2,\"info\":\" The two unnamed youngest sons of the Th\\u00e9nardiers, whom they send to Magnon to replace her two dead sons. Living on the streets, they encounter Gavroche, who is unaware they are his siblings but treats them like they are his brothers. After Gavroche's death, they retrieve bread tossed by a bourgeois man to geese in a fountain at the Luxembourg Garden.\",\"community\":9,\"eigenvector_centrality\":0.0288792593,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3423423423},{\"character\":\"Brujon\",\"degree_centrality\":7,\"info\":\" A robber and criminal. He participates in crimes with M. Th\\u00e9nardier and the Patron-Minette gang (such as the Gorbeau Robbery and the attempted robbery at the Rue Plumet). The author describes Brujon as being \\\"a sprightly young fellow, very cunning and very adroit, with a flurried and plaintive appearance.\\\"\",\"community\":1,\"eigenvector_centrality\":0.101286915,\"betweenness_centrality\":0.0004385965,\"closeness_centrality\":0.38},{\"character\":\"MmeHucheloup\",\"degree_centrality\":7,\"info\":\" Proprietress of the Corinthe tavern  the last defense of the insurgents.\",\"community\":8,\"eigenvector_centrality\":0.1407111607,\"betweenness_centrality\":0.0,\"closeness_centrality\":0.3534883721}]"